In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv("MagicBricks.csv")
df.head()

,Area,BHK,Bathroom,Furnishing,Region,Locality,Parking,Price,Status,Transaction,Type,Per_Sqft
0,1100.0,2,2.0,Unfurnished,Alaknanda,Alaknanda,2.0,15000000,Ready_to_move,Resale,Apartment,12500.0
1,1200.0,2,2.0,Semi-Furnished,Alaknanda,Alaknanda,2.0,17500000,Ready_to_move,Resale,Apartment,12500.0
2,1400.0,2,2.0,Semi-Furnished,Alaknanda,Alaknanda,2.0,14000000,Ready_to_move,Resale,Apartment,12500.0
3,1320.0,3,2.0,Unfurnished,Alaknanda,Alaknanda,2.0,15600000,Ready_to_move,Resale,Apartment,12500.0
4,1100.0,2,2.0,Unfurnished,Alaknanda,Alaknanda,2.0,15000000,Ready_to_move,Resale,Apartment,12500.0

In [3]:
df.shape

(1259, 12)

In [4]:
df.isnull().sum()

Area             0
BHK              0
Bathroom         2
Furnishing       5
Region          39
Locality         0
Parking         33
Price            0
Status           0
Transaction      0
Type             5
Per_Sqft       241
dtype: int64

##  Location,sqft, BHK, Bathroom, Parking

In [5]:
data = df.drop(['Furnishing','Status','Transaction','Locality','Type'], axis=1)
data.head()

     Area  BHK  Bathroom     Region  Parking     Price  Per_Sqft
0  1100.0    2       2.0  Alaknanda      2.0  15000000   12500.0
1  1200.0    2       2.0  Alaknanda      2.0  17500000   12500.0
2  1400.0    2       2.0  Alaknanda      2.0  14000000   12500.0
3  1320.0    3       2.0  Alaknanda      2.0  15600000   12500.0
4  1100.0    2       2.0  Alaknanda      2.0  15000000   12500.0

In [6]:
data.isnull().sum()

Area          0
BHK           0
Bathroom      2
Region       39
Parking      33
Price         0
Per_Sqft    241
dtype: int64

In [7]:
data['Per_Sqft'].fillna(df['Price']/df['Area'], inplace = True)

In [8]:
data = data.dropna()

In [9]:
data.shape

(1192, 7)

#Removing the data which have bathroom more than 4

In [10]:
data[data.BHK < data.Bathroom]

        Area  BHK  Bathroom        Region  Parking     Price      Per_Sqft
60    1800.0    3       4.0   Chhattarpur      2.0  63000000  35000.000000
83    1600.0    3       4.0   Chhattarpur      1.0  60000000   4138.000000
146   1850.0    3       4.0        Dwarka      1.0  24000000   3524.000000
207   1400.0    2       3.0  Geeta Colony      3.0  28600000  20967.000000
208   2100.0    3       4.0  Geeta Colony      2.0  34300000  16333.000000
...      ...  ...       ...           ...      ...       ...           ...
1114    70.0    1       2.0      Shahdara      1.0   4500000   5357.000000
1123   750.0    1       2.0      Shahdara      1.0   6400000   8533.333333
1159   650.0    1       2.0   Vasant Kunj      1.0   7400000  15500.000000
1168   600.0    1       2.0   Vasant Kunj      2.0   7000000  20833.000000
1188   550.0    1       2.0   Vasant Kunj      1.0   7500000  20833.000000

[88 rows x 7 columns]

In [11]:
round(data.Area)

0       1100.0
1       1200.0
2       1400.0
3       1320.0
4       1100.0
         ...
1214    1459.0
1215     780.0
1216    1100.0
1217    1050.0
1218     975.0
Name: Area, Length: 1192, dtype: float64

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1192 entries, 0 to 1218
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Area      1192 non-null   float64
 1   BHK       1192 non-null   int64
 2   Bathroom  1192 non-null   float64
 3   Region    1192 non-null   object
 4   Parking   1192 non-null   float64
 5   Price     1192 non-null   int64
 6   Per_Sqft  1192 non-null   float64
dtypes: float64(4), int64(2), object(1)
memory usage: 74.5+ KB

In [44]:
data.head()

     Area  BHK  Bathroom     Region  Parking       Price
0  1100.0  2.0       2.0  Alaknanda      2.0  15000000.0
1  1200.0  2.0       2.0  Alaknanda      2.0  17500000.0
2  1400.0  2.0       2.0  Alaknanda      2.0  14000000.0
3  1320.0  3.0       2.0  Alaknanda      2.0  15600000.0
4  1100.0  2.0       2.0  Alaknanda      2.0  15000000.0

In [14]:
data[(data.Price/data.Area  <300)]

       Area  BHK  Bathroom  Region  Parking    Price  Per_Sqft
648  4900.0    1       1.0  Narela      1.0  1000000    5051.0

In [15]:
data.drop(data[data['Per_Sqft'] <= 3000].index, inplace = True)

In [16]:
data.drop(["Per_Sqft"], axis=1, inplace=True)

In [17]:
data.shape

(1177, 6)

In [18]:
data.drop(data[data['BHK'] >= 5].index, inplace = True)

In [19]:
data.shape

(1177, 6)

In [20]:
data.drop(data[data['Bathroom'] >= 6].index, inplace = True)

In [21]:
data.shape

(1177, 6)

In [22]:
data.drop(data[data['Parking'] >= 6].index, inplace = True)

In [23]:
data.shape

(1166, 6)

In [24]:
data.head()

     Area  BHK  Bathroom     Region  Parking     Price
0  1100.0    2       2.0  Alaknanda      2.0  15000000
1  1200.0    2       2.0  Alaknanda      2.0  17500000
2  1400.0    2       2.0  Alaknanda      2.0  14000000
3  1320.0    3       2.0  Alaknanda      2.0  15600000
4  1100.0    2       2.0  Alaknanda      2.0  15000000

In [25]:
data.isnull().sum()

Area        0
BHK         0
Bathroom    0
Region      0
Parking     0
Price       0
dtype: int64

In [26]:
data.dtypes

Area        float64
BHK           int64
Bathroom    float64
Region       object
Parking     float64
Price         int64
dtype: object

In [27]:
data['BHK'] = data['BHK'].astype(float)
data['Price'] = data['Price'].astype(float)

In [28]:
data.Region.unique()

array(['Alaknanda', 'Chhattarpur', 'Dishad Garden', 'Dwarka',
       'Geeta Colony', 'Greater Kailash', 'Hauz Khas', 'Kalkaji',
       'Karol Bagh', 'Lajpat Nagar', 'Laxmi Nagar', 'Manglapuri',
       'Mehrauli', 'Moti Nagar', 'Narela', 'New Friends Colony', 'Okhla',
       'Patel Nagar', 'Punjabi Bagh', 'Rohini', 'Safdarjung', 'Saket',
       'Sarita Vihar', 'Shahdara', 'Uttam Nagar', 'Vasant Kunj',
       'Vasundhara'], dtype=object)

In [29]:
dummies = pd.get_dummies(data.Region,dtype=float)

In [30]:
dummies.head()

,Alaknanda,Chhattarpur,Dishad Garden,Dwarka,Geeta Colony,Greater Kailash,Hauz Khas,Kalkaji,Karol Bagh,Lajpat Nagar,...,Patel Nagar,Punjabi Bagh,Rohini,Safdarjung,Saket,Sarita Vihar,Shahdara,Uttam Nagar,Vasant Kunj,Vasundhara
0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [31]:
Data = pd.concat([data, dummies], axis= 1)
Data.head(2)

,Area,BHK,Bathroom,Region,Parking,Price,Alaknanda,Chhattarpur,Dishad Garden,Dwarka,...,Patel Nagar,Punjabi Bagh,Rohini,Safdarjung,Saket,Sarita Vihar,Shahdara,Uttam Nagar,Vasant Kunj,Vasundhara
0,1100.0,2.0,2.0,Alaknanda,2.0,15000000.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,1200.0,2.0,2.0,Alaknanda,2.0,17500000.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [32]:
Data.drop(["Region"], axis=1, inplace=True)

In [46]:
Data.describe()

,Area,BHK,Bathroom,Parking,Price,Alaknanda,Chhattarpur,Dishad Garden,Dwarka,Geeta Colony,...,Patel Nagar,Punjabi Bagh,Rohini,Safdarjung,Saket,Sarita Vihar,Shahdara,Uttam Nagar,Vasant Kunj,Vasundhara
count,1166.000000,1166.000000,1166.000000,1166.000000,1.166000e+03,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,...,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000,1166.000000
mean,1421.819545,2.746141,2.518868,1.420240,1.989434e+07,0.046312,0.024014,0.022298,0.072899,0.056604,...,0.018868,0.024871,0.109777,0.027444,0.074614,0.023156,0.050600,0.022298,0.030017,0.021441
std,1538.122793,0.834275,0.950755,0.680874,2.185259e+07,0.210250,0.153157,0.147716,0.260082,0.231183,...,0.136117,0.155800,0.312746,0.163444,0.262880,0.150464,0.219274,0.147716,0.170708,0.144911
min,28.000000,1.000000,1.000000,1.000000,1.000000e+06,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,810.000000,2.000000,2.000000,1.000000,5.800000e+06,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,1200.000000,3.000000,2.000000,1.000000,1.420000e+07,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,1635.000000,3.000000,3.000000,2.000000,2.500000e+07,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,24300.000000,4.000000,5.000000,5.000000,2.400000e+08,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [34]:
Data.isnull().sum()

Area                  0
BHK                   0
Bathroom              0
Parking               0
Price                 0
Alaknanda             0
Chhattarpur           0
Dishad Garden         0
Dwarka                0
Geeta Colony          0
Greater Kailash       0
Hauz Khas             0
Kalkaji               0
Karol Bagh            0
Lajpat Nagar          0
Laxmi Nagar           0
Manglapuri            0
Mehrauli              0
Moti Nagar            0
Narela                0
New Friends Colony    0
Okhla                 0
Patel Nagar           0
Punjabi Bagh          0
Rohini                0
Safdarjung            0
Saket                 0
Sarita Vihar          0
Shahdara              0
Uttam Nagar           0
Vasant Kunj           0
Vasundhara            0
dtype: int64

In [35]:
X =Data.drop(['Price'], axis=1)
Y =Data['Price']

In [36]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train, Y_test = train_test_split(X,Y,test_size= 0.2, random_state =10)

In [37]:
from sklearn.ensemble import RandomForestRegressor
model = RandomForestRegressor()
model.fit(X_train.values, Y_train.values)
Y_pred = model.predict(X_test.values)

In [38]:
from sklearn.metrics import mean_absolute_error
print("Mean Absolute Error :", mean_absolute_error(Y_test, Y_pred))

Mean Absolute Error : 5150869.725319789

In [39]:
def predict_price(location,sqft,bath,bhk,park):
    loc_index = np.where(X.columns==location)[0][0]
    
    x= np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bath
    x[2] = bhk
    x[3] = park
    if loc_index >= 0:
        x[loc_index] =1
        
    return model.predict([x])[0]

In [40]:
predict_price('Rohini',2200,4,4,3)

28214166.666666664

In [41]:
import pickle
pickle_out = open("model.pkl", "wb")
pickle.dump(model, pickle_out)
pickle_out.close()

In [42]:
pickle_out = open("df.pkl", "wb")
pickle.dump(X, pickle_out)
pickle_out.close()

In [52]:
col = ['Alaknanda', 'Chhattarpur', 'Dishad Garden', 'Dwarka',
       'Geeta Colony', 'Greater Kailash', 'Hauz Khas', 'Kalkaji',
       'Karol Bagh', 'Lajpat Nagar', 'Laxmi Nagar', 'Manglapuri',
       'Mehrauli', 'Moti Nagar', 'Narela', 'New Friends Colony', 'Okhla',
       'Patel Nagar', 'Punjabi Bagh', 'Rohini', 'Safdarjung', 'Saket',
       'Sarita Vihar', 'Shahdara', 'Uttam Nagar', 'Vasant Kunj',
       'Vasundhara']